# RevolutionFailures Properties

---
The BuiltInFailuresRevolutionFailures type exposes the following members.
| Name| Description
---|---|---
| CannotDrawRevolution|  Can't create surface of revolution.
| ProfileCrossesRevolutionAxis|  The profile must not cross the axis of revolution.
| ProfileNotPlanar|  The Profile must lie in a plane.
Top
#### Reference
BuiltInFailuresRevolutionFailures Class
Autodesk.Revit.DB Namespace